import React, { useState } from "react";
import "../App.css";

const Keyboard = () => {
  const [inputText, setInputText] = useState("");
  const [compoundKeys, setCompoundKeys] = useState([]);
  const [tamilChar, setTamilChar] = useState(""); 

  const baseKeys = [
    ["𑀅", "𑀆", "𑀇", "𑀈", "𑀉", "𑀊"],
    ["𑀏𑁆", "𑀏", "𑀐", "𑀑𑁆", "𑀑", "𑀒", "÷"],
    ["𑀓", "𑀘", "𑀝", "𑀢", "𑀧", "𑀫"],
    ["𑀬", "𑀭", "𑀮", "𑀯", "𑀵", "𑀴"],
    ["𑀜", "𑀗", "𑀡", "𑀦","𑀶","𑀷","𑀚", "𑀱", "𑀲", "𑀳"],
  ];

  
  const compoundMap = {
    "𑀓": ["𑀓", "𑀓𑀸", "𑀓𑀺", "𑀓𑀻", "𑀓𑀼", "𑀓𑀽", "𑀓𑀾", "𑀓𑀿", "𑀓𑁀", "𑀓𑁁", "𑀓𑁂", "𑀓𑁃"],
    "𑀘": ["𑀘", "𑀘𑀸", "𑀘𑀺", "𑀘𑀻", "𑀘𑀼", "𑀘𑀽", "𑀘𑀾", "𑀘𑀿", "𑀘𑁀", "𑀘𑁁", "𑀘𑁂", "𑀘𑁃"],
    "𑀝": ["𑀝", "𑀝𑀸", "𑀝𑀺", "𑀝𑀻", "𑀝𑀼", "𑀝𑀽", "𑀝𑀾", "𑀝𑀿", "𑀝𑁀", "𑀝𑁁", "𑀝𑁂", "𑀝𑁃"],
    "𑀢": ["𑀢", "𑀢𑀸", "𑀢𑀺", "𑀢𑀻", "𑀢𑀼", "𑀢𑀽", "𑀢𑀾", "𑀢𑀿", "𑀢𑁀", "𑀢𑁁", "𑀢𑁂", "𑀢𑁃"],
    "𑀧": ["𑀧", "𑀧𑀸", "𑀧𑀺", "𑀧𑀻", "𑀧𑀼", "𑀧𑀽", "𑀧𑀾", "𑀧𑀿", "𑀧𑁀", "𑀧𑁁", "𑀧𑁂", "𑀧𑁃"],
    "𑀫": ["𑀫", "𑀫𑀸", "𑀫𑀺", "𑀫𑀻", "𑀫𑀼", "𑀫𑀽", "𑀫𑀾", "𑀫𑀿", "𑀫𑁀", "𑀫𑁁", "𑀫𑁂", "𑀫𑁃"],

    "𑀬": ["𑀬", "𑀬𑀸", "𑀬𑀺", "𑀬𑀻", "𑀬𑀼", "𑀬𑀽", "𑀬𑀾", "𑀬𑀿", "𑀬𑁀", "𑀬𑁁", "𑀬𑁂", "𑀬𑁃"],
    "𑀭": ["𑀭", "𑀭𑀸", "𑀭𑀺", "𑀭𑀻", "𑀭𑀼", "𑀭𑀽", "𑀭𑀾", "𑀭𑀿", "𑀭𑁀", "𑀭𑁁", "𑀭𑁂", "𑀭𑁃"],
    "𑀮": ["𑀮", "𑀮𑀸", "𑀮𑀺", "𑀮𑀻", "𑀮𑀼", "𑀮𑀽", "𑀮𑀾", "𑀮𑀿", "𑀮𑁀", "𑀮𑁁", "𑀮𑁂", "𑀮𑁃"],
    "𑀯": ["𑀯", "𑀯𑀸", "𑀯𑀺", "𑀯𑀻", "𑀯𑀼", "𑀯𑀽", "𑀯𑀾", "𑀯𑀿", "𑀯𑁀", "𑀯𑁁", "𑀯𑁂", "𑀯𑁃"],
    "𑀵": ["𑀵", "𑀵𑀸", "𑀵𑀺", "𑀵𑀻", "𑀵𑀼", "𑀵𑀽", "𑀵𑀾", "𑀵𑀿", "𑀵𑁀", "𑀵𑁁", "𑀵𑁂", "𑀵𑁃"],
    "𑀴": ["𑀴", "𑀴𑀸", "𑀴𑀺", "𑀴𑀻", "𑀴𑀼", "𑀴𑀽", "𑀴𑀾", "𑀴𑀿", "𑀴𑁀", "𑀴𑁁", "𑀴𑁂", "𑀴𑁃"],

    "𑀜": ["𑀜", "𑀜𑀸", "𑀜𑀺", "𑀜𑀻", "𑀜𑀼", "𑀜𑀽", "𑀜𑀾", "𑀜𑀿", "𑀜𑁀", "𑀜𑁁", "𑀜𑁂", "𑀜𑁃"],
    "𑀗": ["𑀗", "𑀗𑀸", "𑀗𑀺", "𑀗𑀻", "𑀗𑀼", "𑀗𑀽", "𑀗𑀾", "𑀗𑀿", "𑀗𑁀", "𑀗𑁁", "𑀗𑁂", "𑀗𑁃"],
    "𑀡": ["𑀡", "𑀡𑀸", "𑀡𑀺", "𑀡𑀻", "𑀡𑀼", "𑀡𑀽", "𑀡𑀾", "𑀡𑀿", "𑀡𑁀", "𑀡𑁁", "𑀡𑁂", "𑀡𑁃"],
    "𑀦": ["𑀦", "𑀦𑀸", "𑀦𑀺", "𑀦𑀻", "𑀦𑀼", "𑀦𑀽", "𑀦𑀾", "𑀦𑀿", "𑀦𑁀", "𑀦𑁁", "𑀦𑁂", "𑀦𑁃"],
    "𑀶": ["𑀶", "𑀶𑀸", "𑀶𑀺", "𑀶𑀻", "𑀶𑀼", "𑀶𑀽", "𑀶𑀾", "𑀶𑀿", "𑀶𑁀", "𑀶𑁁", "𑀶𑁂", "𑀶𑁃"],
    "𑀷": ["𑀷", "𑀷𑀸", "𑀷𑀺", "𑀷𑀻", "𑀷𑀼", "𑀷𑀽", "𑀷𑀾", "𑀷𑀿", "𑀷𑁀", "𑀷𑁁", "𑀷𑁂", "𑀷𑁃"],

    "𑀚": ["𑀚", "𑀚𑀸", "𑀚𑀺", "𑀚𑀻", "𑀚𑀼", "𑀚𑀽", "𑀚𑀾", "𑀚𑀿", "𑀚𑁀", "𑀚𑁁", "𑀚𑁂", "𑀚𑁃"],
    "𑀱": ["𑀱", "𑀱𑀸", "𑀱𑀺", "𑀱𑀻", "𑀱𑀼", "𑀱𑀽", "𑀱𑀾", "𑀱𑀿", "𑀱𑁀", "𑀱𑁁", "𑀱𑁂", "𑀱𑁃"],
    "𑀲": ["𑀲", "𑀲𑀸", "𑀲𑀺", "𑀲𑀻", "𑀲𑀼", "𑀲𑀽", "𑀲𑀾", "𑀲𑀿", "𑀲𑁀", "𑀲𑁁", "𑀲𑁂", "𑀲𑁃"],
    "𑀳": ["𑀳", "𑀳𑀸", "𑀳𑀺", "𑀳𑀻", "𑀳𑀼", "𑀳𑀽", "𑀳𑀾", "𑀳𑀿", "𑀳𑁀", "𑀳𑁁", "𑀳𑁂", "𑀳𑁃"]
    
  };

  
  const bramiToTamil = {
   
 
  "𑀅": "அ", "𑀆": "ஆ", "𑀇": "இ", "𑀈": "ஈ",
  "𑀉": "உ", "𑀊": "ஊ",
  "𑀏𑁆": "எ", "𑀏": "ஏ", "𑀐": "ஐ", 
  "𑀑𑁆": "ஒ", "𑀑": "ஓ", "𑀒": "ஔ",
  "÷":"ஃ",
  
  "𑀓": "க", "𑀓𑀸": "கா", "𑀓𑀺": "கி", "𑀓𑀻": "கீ",
  "𑀓𑀼": "கு", "𑀓𑀽": "கூ", "𑀓𑀾": "கெ", "𑀓𑀿": "கே",
  "𑀓𑁀": "கை", "𑀓𑁁": "கொ", "𑀓𑁂": "கோ", "𑀓𑁃": "கௌ",

  
  "𑀘": "ச", "𑀘𑀸": "சா", "𑀘𑀺": "சி", "𑀘𑀻": "சீ",
  "𑀘𑀼": "சு", "𑀘𑀽": "சூ", "𑀘𑀾": "செ", "𑀘𑀿": "சே",
  "𑀘𑁀": "சை", "𑀘𑁁": "சொ", "𑀘𑁂": "சோ", "𑀘𑁃": "சௌ",

  "𑀝": "ஞ", "𑀝𑀸": "ஞா", "𑀝𑀺": "ஞி", "𑀝𑀻": "ஞீ",
  "𑀝𑀼": "ஞு", "𑀝𑀽": "ஞூ", "𑀝𑀾": "ஞெ", "𑀝𑀿": "ஞே",
  "𑀝𑁀": "ஞை", "𑀝𑁁": "ஞொ", "𑀝𑁂": "ஞோ", "𑀝𑁃": "ஞௌ",

  "𑀢": "ட", "𑀢𑀸": "டா", "𑀢𑀺": "டி", "𑀢𑀻": "டீ",
  "𑀢𑀼": "டு", "𑀢𑀽": "டூ", "𑀢𑀾": "டெ", "𑀢𑀿": "டே",
  "𑀢𑁀": "டை", "𑀢𑁁": "டொ", "𑀢𑁂": "டோ", "𑀢𑁃": "டௌ",

  
  "𑀧": "த", "𑀧𑀸": "தா", "𑀧𑀺": "தி", "𑀧𑀻": "தீ",
  "𑀧𑀼": "து", "𑀧𑀽": "தூ", "𑀧𑀾": "தெ", "𑀧𑀿": "தே",
  "𑀧𑁀": "தை", "𑀧𑁁": "தொ", "𑀧𑁂": "தோ", "𑀧𑁃": "தௌ",

  "𑀫": "ந", "𑀫𑀸": "நா", "𑀫𑀺": "நி", "𑀫𑀻": "நீ",
  "𑀫𑀼": "நு", "𑀫𑀽": "நூ", "𑀫𑀾": "நெ", "𑀫𑀿": "நே",
  "𑀫𑁀": "நை", "𑀫𑁁": "நொ", "𑀫𑁂": "நோ", "𑀫𑁃": "நௌ",

  
  "𑀬": "ம", "𑀬𑀸": "மா", "𑀬𑀺": "மி", "𑀬𑀻": "மீ",
  "𑀬𑀼": "மு", "𑀬𑀽": "மூ", "𑀬𑀾": "மெ", "𑀬𑀿": "மே",
  "𑀬𑁀": "மை", "𑀬𑁁": "மொ", "𑀬𑁂": "மோ", "𑀬𑁃": "மௌ",

  
  "𑀭": "ய", "𑀭𑀸": "யா", "𑀭𑀺": "யி", "𑀭𑀻": "யீ",
  "𑀭𑀼": "யு", "𑀭𑀽": "யூ", "𑀭𑀾": "யெ", "𑀭𑀿": "யே",
  "𑀭𑁀": "யை", "𑀭𑁁": "யொ", "𑀭𑁂": "யோ", "𑀭𑁃": "யௌ",

  "𑀮": "ர", "𑀮𑀸": "ரா", "𑀮𑀺": "ரி", "𑀮𑀻": "ரீ",
  "𑀮𑀼": "ரு", "𑀮𑀽": "ரூ", "𑀮𑀾": "ரெ", "𑀮𑀿": "ரே",
  "𑀮𑁀": "ரை", "𑀮𑁁": "ரொ", "𑀮𑁂": "ரோ", "𑀮𑁃": "ரௌ",

  "𑀯": "ல", "𑀯𑀸": "லா", "𑀯𑀺": "லி", "𑀯𑀻": "லீ",
  "𑀯𑀼": "லு", "𑀯𑀽": "லூ", "𑀯𑀾": "லெ", "𑀯𑀿": "லே",
  "𑀯𑁀": "லை", "𑀯𑁁": "லொ", "𑀯𑁂": "லோ", "𑀯𑁃": "லௌ",

  "𑀵": "வ", "𑀵𑀸": "வா", "𑀵𑀺": "வி", "𑀵𑀻": "வீ",
  "𑀵𑀼": "வு", "𑀵𑀽": "வூ", "𑀵𑀾": "வெ", "𑀵𑀿": "வே",
  "𑀵𑁀": "வை", "𑀵𑁁": "வொ", "𑀵𑁂": "வோ", "𑀵𑁃": "வௌ",

  
  "𑀴": "ழ", "𑀴𑀸": "ழா", "𑀴𑀺": "ழி", "𑀴𑀻": "ழீ",
  "𑀴𑀼": "ழு", "𑀴𑀽": "ழூ", "𑀴𑀾": "ழெ", "𑀴𑀿": "ழே",
  "𑀴𑁀": "ழை", "𑀴𑁁": "ழொ", "𑀴𑁂": "ழோ", "𑀴𑁃": "ழௌ",

  "𑀜": "ஷ", "𑀜𑀸": "ஷா", "𑀜𑀺": "ஷி", "𑀜𑀻": "ஷீ",
  "𑀜𑀼": "ஷு", "𑀜𑀽": "ஷூ", "𑀜𑀾": "ஷெ", "𑀜𑀿": "ஷே",
  "𑀜𑁀": "ஷை", "𑀜𑁁": "ஷொ", "𑀜𑁂": "ஷோ", "𑀜𑁃": "ஷௌ",

 
  "𑀗": "ஜ", "𑀗𑀸": "ஜா", "𑀗𑀺": "ஜி", "𑀗𑀻": "ஜீ",
  "𑀗𑀼": "ஜு", "𑀗𑀽": "ஜூ", "𑀗𑀾": "ஜெ", "𑀗𑀿": "ஜே",
  "𑀗𑁀": "ஜை", "𑀗𑁁": "ஜொ", "𑀗𑁂": "ஜோ", "𑀗𑁃": "ஜௌ",

  "𑀡": "ண", "𑀡𑀸": "ணா", "𑀡𑀺": "ணி", "𑀡𑀻": "ணீ",
  "𑀡𑀼": "ணு", "𑀡𑀽": "ணூ", "𑀡𑀾": "ணெ", "𑀡𑀿": "ணே",
  "𑀡𑁀": "ணை", "𑀡𑁁": "ணொ", "𑀡𑁂": "ணோ", "𑀡𑁃": "ணௌ",

  
  "𑀦": "ந", "𑀦𑀸": "நா", "𑀦𑀺": "நி", "𑀦𑀻": "நீ",
  "𑀦𑀼": "நு", "𑀦𑀽": "நூ", "𑀦𑀾": "நெ", "𑀦𑀿": "நே",
  "𑀦𑁀": "நை", "𑀦𑁁": "நொ", "𑀦𑁂": "நோ", "𑀦𑁃": "நௌ",

  
  "𑀶": "ஷ", "𑀶𑀸": "ஷா", "𑀶𑀺": "ஷி", "𑀶𑀻": "ஷீ",
  "𑀶𑀼": "ஷு", "𑀶𑀽": "ஷூ", "𑀶𑀾": "ஷெ", "𑀶𑀿": "ஷே",
  "𑀶𑁀": "ஷை", "𑀶𑁁": "ஷொ", "𑀶𑁂": "ஷோ", "𑀶𑁃": "ஷௌ",

  
"𑀷": "ஷ", "𑀷𑀸": "ஷா", "𑀷𑀺": "ஷி", "𑀷𑀻": "ஷீ",
"𑀷𑀼": "ஷு", "𑀷𑀽": "ஷூ", "𑀷𑀾": "ஷெ", "𑀷𑀿": "ஷே",
"𑀷𑁀": "ஷை", "𑀷𑁁": "ஷொ", "𑀷𑁂": "ஷோ", "𑀷𑁃": "ஷௌ",

"𑀚": "ஸ", "𑀚𑀸": "ஸா", "𑀚𑀺": "ஸி", "𑀚𑀻": "ஸீ",
"𑀚𑀼": "ஸு", "𑀚𑀽": "ஸூ", "𑀚𑀾": "ஸெ", "𑀚𑀿": "ஸே",
"𑀚𑁀": "ஸை", "𑀚𑁁": "ஸொ", "𑀚𑁂": "ஸோ", "𑀚𑁃": "ஸௌ",


"𑀱": "ஹ", "𑀱𑀸": "ஹா", "𑀱𑀺": "ஹி", "𑀱𑀻": "ஹீ",
"𑀱𑀼": "ஹு", "𑀱𑀽": "ஹூ", "𑀱𑀾": "ஹெ", "𑀱𑀿": "ஹே",
"𑀱𑁀": "ஹை", "𑀱𑁁": "ஹொ", "𑀱𑁂": "ஹோ", "𑀱𑁃": "ஹௌ",


"𑀲": "ற", "𑀲𑀸": "றா", "𑀲𑀺": "றி", "𑀲𑀻": "றீ",
"𑀲𑀼": "று", "𑀲𑀽": "றூ", "𑀲𑀾": "றெ", "𑀲𑀿": "றே",
"𑀲𑁀": "றை", "𑀲𑁁": "றொ", "𑀲𑁂": "றோ", "𑀲𑁃": "றௌ",

"𑀳": "ன", "𑀳𑀸": "னா", "𑀳𑀺": "னி", "𑀳𑀻": "னீ",
"𑀳𑀼": "னு", "𑀳𑀽": "னூ", "𑀳𑀾": "னெ", "𑀳𑀿": "னே",
"𑀳𑁀": "னை", "𑀳𑁁": "னொ", "𑀳𑁂": "னோ", "𑀳𑁃": "னௌ",
};


  const consonants = Object.keys(compoundMap);

  const handleKeyClick = (char) => {
  if (consonants.includes(char)) {
    setCompoundKeys(compoundMap[char]);
   
    setTamilChar(bramiToTamil[compoundMap[char][0]] || "");
  } else {
    setInputText((prev) => prev + char);
    setCompoundKeys([]);
    setTamilChar(bramiToTamil[char] || "");
  }
};

const handleCompoundClick = (char) => {
  setInputText((prev) => prev + char);
  setTamilChar(bramiToTamil[char] || char); 
};
  const handleClear = () => {
    setInputText("");
    setCompoundKeys([]);
    setTamilChar("");
  };

  return (

    <section
  className="section"
  style={{
    marginLeft: "150px",   
    marginTop: "30px",     
    marginRight: "10px",  
    marginBottom: "20px",  
  }}
>
  <h2>விசைப்பலகை</h2>

      <div
  className="split-container"
  style={{
    fontSize : "2xl",
    display: "flex",
    gap: "0px",
    marginLeft: "40px",   
    marginRight: "10px",  
    marginTop: "30px",    
    marginBottom: "20px", 
  }}>
        <div className="input-box">
          <div className="display-box">{inputText || "இங்கே தட்டச்சு செய்யவும்..."}</div>
          <div className="keyboard">
            {baseKeys.map((row, i) => (
              <div key={i} className="keyboard-row">
                {row.map((key) => (
                  <button key={key} className="key-btn" onClick={() => handleKeyClick(key)}>
                    {key}
                  </button>
                ))}
              </div>
            ))}

            {compoundKeys.length > 0 && (
              <div className="keyboard-row compound-row">
                {compoundKeys.map((ckey) => (
                  <button key={ckey} className="key-btn compound" onClick={() => handleCompoundClick(ckey)}>
                    {ckey}
                  </button>
                ))}
              </div>
            )}

            <button className="key-btn clear" onClick={handleClear}>⌫ அழி</button>
          </div>
        </div>

        
        <div style={{ marginLeft: "10px", marginTop: "20px",marginRight: "40px" }}>
        <div className="tamil-box" style={{ border: "2px solid #000", padding: "10px", minWidth: "95px", fontSize:"3xl" }}>
             {tamilChar || "மொழிபெயர்க்கப்பட்ட எழுத்து"}
        </div>
        </div>
        </div>
    </section>
  );
};

export default Keyboard;
